# Основные протоколы сети интернет
______  
1. Настройте NAT(PAT) на R14 и R15. Трансляция должна осуществляться в адрес автономной системы AS1001.  
2. Настройте NAT(PAT) на R18. Трансляция должна осуществляться в пул из 5 адресов автономной системы AS2042.  
3. Настройте статический NAT для R20.  
4. Настройте NAT так, чтобы R19 был доступен с любого узла для удаленного управления.  
5*. Настройте статический NAT(PAT) для офиса Чокурдах.  
5. Настройте для IPv4 DHCP сервер в офисе Москва на маршрутизаторах R12 и R13. VPC1 и VPC7 должны получать сетевые настройки по DHCP.  
6. Настройте NTP сервер на R12 и R13. Все устройства в офисе Москва должны синхронизировать время с R12 и R13.  
   
### Схема  
![scheme](https://github.com/Alnor23/OTUS_NETWORK/blob/main/labs/lab9_bgp/screenshots/Scheme.png)   

### Таблица адресации  
Management  

Device | IPv4 Address  | Subnet Mask    | IPv6 GLA Address         | IPv6 LLA Address | AS
-------|---------------|----------------|--------------------------|----------------- | -------
R14    |10.1.1.3       |255.255.255.255 |20FF:0DB8:ACAD:1001::14/64|FE80::14/8        |1001(Москва)
R15    |10.1.1.5       |255.255.255.255 |20FF:0DB8:ACAD:1001::15/64|FE80::15/8        |1001(Москва)
R18    |10.2.1.2       |255.255.255.255 |20FF:0DB8:ACAD:2001::18/64|FE80::18/8        |1001(СПб)
R23    |10.10.1.2      |255.255.255.255 |20FF:0DB8:ACAD:4001::23/64|FE80::23/8        |520(Триада)
R24    |10.10.1.3      |255.255.255.255 |20FF:0DB8:ACAD:4001::24/64|FE80::24/8        |520(Триада)
R25    |10.10.1.4      |255.255.255.255 |20FF:0DB8:ACAD:4001::25/64|FE80::25/8        |520(Триада)
R26    |10.10.1.5      |255.255.255.255 |20FF:0DB8:ACAD:4001::26/64|FE80::26/8        |520(Триада)
R22    |10.11.1.2      |255.255.255.248 |20FF:ODB8:ACAD:5001::22/64|FE80::22/8        |101(Киторн)
R21    |10.12.1.2      |255.255.255.248 |20FF:0DB8:ACAD:6001::21/64|FE80::21/8        |301(Ламас)

Link outside AS  

Device | Port | Address type | Address                      | Network
------ |------|--------------|------------------------------|---------
R23    |e0/0  |IPv4          |50.50.1.1/30                  |50.50.1.0/30
R23    |e0/0  |IPv6          |20FF:0DB8:ACAD:7001::23:/64   |20FF:0DB8:ACAD:7001::/64
R22    |e0/2  |IPv4          |50.50.1.2/30                  |50.50.1.0/30
R22    |e0/2  |IPv6          |20FF:0DB8:ACAD:7001::22:2/64   |20FF:0DB8:ACAD:7001::/64
||||
R24    |e0/0  |IPv4          |50.50.1.5/30                  |50.50.1.4/30
R24    |e0/0  |IPv6          |20FF:0DB8:ACAD:7002::24:/64   |20FF:0DB8:ACAD:7002::/64
R21    |e0/2  |IPv4          |50.50.1.6/30                  |50.50.1.4/30
R21    |e0/2  |IPv6          |20FF:0DB8:ACAD:7002::21:2/64  |20FF:0DB8:ACAD:7002::/64
||||
R24    |e0/3  |IPv4          |50.50.1.9/30                  |50.50.1.8/30
R24    |e0/3  |IPv6          |20FF:0DB8:ACAD:7003::24:3/64  |20FF:0DB8:ACAD:7003::/64
R18    |e0/2  |IPv4          |50.50.1.10/30                 |50.50.1.8/30
R18    |e0/2  |IPv6          |20FF:0DB8:ACAD:7003::18:2/64  |20FF:0DB8:ACAD:7003::/64
||||
R26    |e0/3  |IPv4          |50.50.1.13/30                 |50.50.1.12/30
R26    |e0/3  |IPv6          |20FF:0DB8:ACAD:7004::26:3/64  |20FF:0DB8:ACAD:7004::/64
R18    |e0/3  |IPv4          |50.50.1.14/30                 |50.50.1.12/30
R18    |e0/3  |IPv6          |20FF:0DB8:ACAD:7004::18:3/64  |20FF:0DB8:ACAD:7004::/64
||||
R26    |e0/1  |IPv4          |50.50.1.17/30                 |50.50.1.16/30
R26    |e0/1  |IPv6          |20FF:0DB8:ACAD:7005::26:1/64  |20FF:0DB8:ACAD:7005::/64
R28    |e0/0  |IPv4          |50.50.1.18/30                 |50.50.1.16/30
R28    |e0/0  |IPv6          |20FF:0DB8:ACAD:7005::28:0/64  |20FF:0DB8:ACAD:7005::/64
||||
R25    |e0/3  |IPv4          |50.50.1.21/30                 |50.50.1.20/30
R25    |e0/3  |IPv6          |20FF:0DB8:ACAD:7006::25:3/64  |20FF:0DB8:ACAD:7006::/64
R28    |e0/1  |IPv4          |50.50.1.22/30                 |50.50.1.20/30
R28    |e0/1  |IPv6          |20FF:0DB8:ACAD:7006::28:1/64  |20FF:0DB8:ACAD:7006::/64
||||
R25    |e0/1  |IPv4          |50.50.1.25/30                 |50.50.1.24/30
R25    |e0/1  |IPv6          |20FF:0DB8:ACAD:7007::25:1/64  |20FF:0DB8:ACAD:7007::/64
R27    |e0/0  |IPv4          |50.50.1.26/30                 |50.50.1.24/30
R27    |e0/0  |IPv6          |20FF:0DB8:ACAD:7007::27:/64   |20FF:0DB8:ACAD:7007::/64
||||
R22    |e0/0  |IPv4          |50.50.1.29/30                 |50.50.1.28/30
R22    |e0/0  |IPv6          |20FF:0DB8:ACAD:7008::22:/64   |20FF:0DB8:ACAD:7008::/64
R14    |e0/2  |IPv4          |50.50.1.30/30                 |50.50.1.28/30
R14    |e0/2  |IPv6          |20FF:0DB8:ACAD:7008::14:2/64  |20FF:0DB8:ACAD:7008::/64
||||
R22    |e0/1  |IPv4          |50.50.1.33/30                 |50.50.1.32/30
R22    |e0/1  |IPv6          |20FF:0DB8:ACAD:7009::22:1/64  |20FF:0DB8:ACAD:7009::/64
R21    |e0/1  |IPv4          |50.50.1.34/30                 |50.50.1.32/30
R21    |e0/1  |IPv6          |20FF:0DB8:ACAD:7009::21:1/64  |20FF:0DB8:ACAD:7009::/64
||||
R21    |e0/0  |IPv4          |50.50.1.37/30                 |50.50.1.36/30
R21    |e0/0  |IPv6          |20FF:0DB8:ACAD:7010::21:/64   |20FF:0DB8:ACAD:7010::/64
R15    |e0/2  |IPv4          |50.50.1.38/30                 |50.50.1.36/30
R15    |e0/2  |IPv6          |20FF:0DB8:ACAD:7010::15:2/64  |20FF:0DB8:ACAD:7010::/64

Link inside AS  

Device | Port | Address type | Address                      | Network
------ |------|--------------|------------------------------|---------
R14    | e1/0 | IPv4         | 10.1.2.33/30                 | 10.1.2.32/30 
R14    | e1/0 | IPv6         | 20FF:0DB8:ACAD:1016::14:10/64| 20FF:0DB8:ACAD:1016::/64
R15    | e1/0 | IPv4         | 10.1.2.34/30                 | 10.1.2.32/30 
R15    | e1/0 | IPv6         | 20FF:0DB8:ACAD:1016::15:10/64| 20FF:0DB8:ACAD:1016::/64
||||
R23    |e0/1  |IPv4          |10.10.2.1/30                  |10.10.2.0/30
R23    |e0/1  |IPv6          |20FF:0DB8:ACAD:4011::23:1/64  |20FF:0DB8:ACAD:4011::/64
R25    |e0/0  |IPv4          |10.10.2.2/30                  |10.10.2.0/30
R25    |e0/0  |IPv6          |20FF:0DB8:ACAD:4011::25:/64   |20FF:0DB8:ACAD:4011::/64
||||
R25    |e0/2  |IPv4          |10.10.2.5/30                  |10.10.2.4/30
R25    |e0/2  |IPv6          |20FF:0DB8:ACAD:4012::25:2/64  |20FF:0DB8:ACAD:4012::/64
R26    |e0/2  |IPv4          |10.10.2.6/30                  |10.10.2.4/30
R26    |e0/2  |IPv6          |20FF:0DB8:ACAD:4012::26:2/64  |20FF:0DB8:ACAD:4000::/64
|||| 
R26    |e0/0  |IPv4          |10.10.2.9/30                  |10.10.2.8/30
R26    |e0/0  |IPv6          |20FF:0DB8:ACAD:4013::26:/64   |20FF:0DB8:ACAD:4013::/64
R24    |e0/1  |IPv4          |10.10.2.10/30                 |10.10.2.8/30
R24    |e0/1  |IPv6          |20FF:0DB8:ACAD:4013::24:1/64  |20FF:0DB8:ACAD:4013::/64
||||
R24    |e0/2  |IPv4          |10.10.2.13/30                 |10.10.2.12/30
R24    |e0/2  |IPv6          |20FF:0DB8:ACAD:4014::24:2/64  |20FF:0DB8:ACAD:4014::/64
R23    |e0/2  |IPv4          |10.10.2.14/30                 |10.10.2.12/30
R23    |e0/2  |IPv6          |20FF:0DB8:ACAD:4014::23:2/64  |20FF:0DB8:ACAD:4014::/64

### Часть 1. Настроите NAT(PAT) на R14 и R15. Трансляция должна осуществляться в адрес автономной системы AS1001.  
Для выполнения задания в начале необходимо настроить интерфейсы соответствующим образом:  
```
R14(config)#int e0/2
R14(config-if)#ip nat outside
R14(config)#int range  e0/0,e0/1,e0/3,e1/0
R14(config-if-range)#ip nat inside
```
Далее создается access-list в который входит множество сетей AS 1001(Москва)(10.1.0.0/16):  
```
R14#sh run | s acc
access-list 1 permit 10.1.0.0 0.0.255.255
```
Затем мы настраиваем трансляцию:  
```
R15(config)#do sh run | sec ip nat
ip nat inside source list 1 interface Ethernet0/2 overload
```
Для проверки выполним icmp запрос из AS 1001 на внешние адреса а затем выполним просмотр трансляций на R15:  
```
R15#sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
icmp 50.50.1.38:16046  10.1.3.2:16046     50.50.1.37:16046   50.50.1.37:16046
icmp 50.50.1.38:16302  10.1.3.2:16302     50.50.1.37:16302   50.50.1.37:16302
icmp 50.50.1.38:16558  10.1.3.2:16558     50.50.1.37:16558   50.50.1.37:16558
icmp 50.50.1.38:16814  10.1.3.2:16814     50.50.1.37:16814   50.50.1.37:16814
icmp 50.50.1.38:17070  10.1.3.2:17070     50.50.1.37:17070   50.50.1.37:17070
```
(Настройки на R14 и R15 аналогичны).  

### Часть 2. Настройте NAT(PAT) на R18. Трансляция должна осуществляться в пул из 5 адресов автономной системы AS2042.  
Так как изначально между AS 2042(СПБ) и AS 520(Триада) нету 5 адресов поэтому изменим сеть между R18 и R24 c /30 на /28 (c 50.50.1.8/30 на 50.50.21.0/28).   
Затем настроим интерфейсы на R18:   
```
R18(config)#int e0/2
R18(config-if)#ip nat outside
R18(config)#int range e0/0-1
R18(config-if-range)#ip nat inside
```
Далее создается access-list в который входит множество сетей AS2042 (СПб):  
```
R18(config)#do sh run | s acc
access-list 1 permit 10.2.0.0 0.0.255.255
```
И создается пул куда будут транслироваться эти адреса:
```
R18#sh run | s nat
ip nat pool pool1 50.50.21.2 50.50.21.6 netmask 255.255.255.248
```
Затем мы настраиваем трансляцию:  
```
R18#sh run | s nat
 ip nat inside source list 1 pool pool1
```
Для проверки выполним icmp запрос из AS 2042(VPC8) на внешние адреса а затем выполним просмотр трансляций на R18:  
```
R18#sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
icmp 50.50.21.2:4      10.2.1.2:4         50.50.21.7:4       50.50.21.7:4
icmp 50.50.21.2:5      10.2.1.2:5         50.50.21.7:5       50.50.21.7:5
--- 50.50.21.2         10.2.1.2           ---                ---
```
### Часть 3. Настройте статический NAT для R20.  
Для настройки статического NAT с дальнейшей демонстрации его работы и так как R20 является тупиковым роутером, NAT будет настроен на трансляцию адреса loopback(10.1.1.7) через адрес интерфейса(10.1.2.30).  
Сначало настроим интерфейсы:  
```
R20(config)#int e0/0
R20(config-if)#ip nat outside
R20(config)#int lo1
R20(config-if)#ip nat inside
```
Затем мы настраиваем трансляцию: 
```
R20(config)#do sh run | sec ip nat
ip nat inside source static 10.1.1.7 10.1.2.30
```
Для проверки выполним запрос с адреса loopback(10.1.1.7) на любой адрес внутри AS:  
```
R20#ping 10.1.2.34 source 10.1.1.7
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.34, timeout is 2 seconds:
Packet sent with a source address of 10.1.1.7
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
```
Затем выполним просмотр трансляций:  
```
R20#sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
icmp 10.1.2.30:5       10.1.1.7:5         10.1.2.34:5        10.1.2.34:5
--- 10.1.2.30          10.1.1.7           ---                ---
```
### Часть  4. Настройте NAT так, чтобы R19 был доступен с любого узла для удаленного управления.  
Для выполнения этого задания создадим на R15 loopback интерфейс:  
```
interface Loopback2
 ip address 50.50.1.100 255.255.255.255
 ip ospf network point-to-point
 ip ospf 1 area 0
end
```
Дальше создадим статический NAT (который транслирует адрес loopback интерфейса R19 во внешний адрес):  
```
R15#sh run | s nat
ip nat inside source static 10.1.1.2 50.50.1.100
```
Затем выполним попытку подключения по telnet к R19 c устройства R18 (находящемся в AS 2042 СПБ):  
```
R18#telnet 50.50.1.100 /source-interface lo1
Trying 50.50.1.100 ... Open


User Access Verification

Username: cisco
Password:
R19>
R19>exit

[Connection to 50.50.1.100 closed by foreign host]
```
Видно что подключение по telnet выполнено.  

### Часть 5*. Настройте статический NAT(PAT) для офиса Чокурдах.
`ОФФТОП: из текста задания не понял что необходимо сделать статический NAT или PAT, для выполнения задания выбрал настройку PAT`   
Для выполнения задания в начале необходимо настроить интерфейсы соответствующим образом:  
```
R28(config)#int e0/1
R28(config-if)#ip nat outside
R28(config)#int e0/2.30
R28(config-subif)#ip nat inside
R28(config-subif)#ex
R28(config)#int e0/2.31
R28(config-subif)#ip nat inside
R28(config-subif)#int e0/2.32
R28(config-subif)#ip nat inside
R28(config-subif)#end
```
Далее создается access-list в который входит адреса Чокурдах (10.3.0.0/16)
```
R28(config)#do sh run | sec acc
access-list 1 permit 10.3.0.0 0.0.255.255
```
Затем мы настраиваем трансляцию:  
```
R28(config)#do sh run | s ip nat
ip nat inside source list 1 interface Ethernet0/1 overload
```
Для проверки выполним icmp запрос из AS 2042(VPC8) на внешние адреса а затем выполним просмотр трансляций на R18:  
```
R28#sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
icmp 50.50.1.22:22433  10.3.3.18:22433    50.50.1.21:22433   50.50.1.21:22433
icmp 50.50.1.22:22689  10.3.3.18:22689    50.50.1.21:22689   50.50.1.21:22689
icmp 50.50.1.22:22945  10.3.3.18:22945    50.50.1.21:22945   50.50.1.21:22945
icmp 50.50.1.22:23201  10.3.3.18:23201    50.50.1.21:23201   50.50.1.21:23201
icmp 50.50.1.22:23457  10.3.3.18:23457    50.50.1.21:23457   50.50.1.21:23457
```
### Часть 5. Настройте для IPv4 DHCP сервер в офисе Москва на маршрутизаторах R12 и R13. VPC1 и VPC7 должны получать сетевые настройки по DHCP.  
В данном задании R12 будет настроен как DHCP сервер для VPC1(10.1.3.0/28), а R13 для VPC7(10.1.3.16/28):  
Настройка R12:  
```
R12(config)#do sh run | sec dhcp
ip dhcp excluded-address 10.1.3.1
ip dhcp pool VPC1_client
 network 10.1.3.0 255.255.255.240
 default-router 10.1.3.1
```
Настройка R13:  
```
R13(config)#do sh run | sec dhcp
ip dhcp excluded-address 10.1.3.17
ip dhcp pool VPC7_client
 network 10.1.3.16 255.255.255.240
 default-router 10.1.3.17
```
Проверка VPC1:  
```
VPCS> ip dhcp
DDORA IP 10.1.3.3/28 GW 10.1.3.1

VPCS> sh ip

NAME        : VPCS[1]
IP/MASK     : 10.1.3.3/28
GATEWAY     : 10.1.3.1
DNS         :
DHCP SERVER : 10.1.3.1
DHCP LEASE  : 86391, 86400/43200/75600
MAC         : 00:50:79:66:68:01
LPORT       : 20000
RHOST:PORT  : 127.0.0.1:30000
MTU         : 1500
```
Проверка VPC7:  
```
VPCS> ip dhcp
DDORA IP 10.1.3.19/28 GW 10.1.3.17

VPCS> sh ip

NAME        : VPCS[1]
IP/MASK     : 10.1.3.19/28
GATEWAY     : 10.1.3.17
DNS         :
DHCP SERVER : 10.1.3.17
DHCP LEASE  : 86390, 86400/43200/75600
MAC         : 00:50:79:66:68:07
LPORT       : 20000
RHOST:PORT  : 127.0.0.1:30000
MTU         : 1500
```

### Часть 6. Настройте NTP сервер на R12 и R13. Все устройства в офисе Москва должны синхронизировать время с R12 и R13.   
Настроим устройства R12 и R13 как NTP сервера:  
```
R12(config)#ntp master 10
R12(config)#int range e0/0-3, lo1
R12(config-if-range)#ntp broadcast
```
(На R13 настройка аналогичная).  
Далее на клиентах укажем сервера (в качестве адресов сервера используются loopback интерфейсы):  
```
R14#sh run | sec ntp
ntp server 10.1.1.4
ntp server 10.1.1.6
```
Выполним проверку:  
```
R14#sh ntp associations

  address         ref clock       st   when   poll reach  delay  offset   disp
 ~10.1.1.4        127.127.1.1     10     28     64     0  0.000   0.000 15937.
 ~10.1.1.6        127.127.1.1     10     26     64     0  0.000   0.000 15937.
 * sys.peer, # selected, + candidate, - outlyer, x falseticker, ~ configured
```
_______
  - [Конфигурации устройств](https://github.com/Alnor23/OTUS_NETWORK/tree/main/labs/lab12_baseprot/config)




